blueinnotechnology/blueinno-board/boards.txt
blueinno_rp2040.menu.uploadmethod.picotool.build.picodebugflags=-DENABLE_PICOTOOL_USB
blueinno_rp2040.menu.uploadmethod.picotool.upload.maximum_data_size=262144
blueinno_rp2040.menu.uploadmethod.picotool.upload.tool=picotool
blueinno_rp2040.menu.uploadmethod.picotool.upload.tool.default=picotool
blueinno_rp2040.menu.uploadmethod.picoprobe=Picoprobe
blueinno_rp2040.menu.uploadmethod.picoprobe.build.ram_length=256k
blueinno_rp2040.menu.uploadmethod.picoprobe.build.debugscript=picoprobe.tcl
blueinno_rp2040.menu.uploadmethod.picoprobe.upload.maximum_data_size=262144
blueinno_rp2040.menu.uploadmethod.picoprobe.upload.tool=picoprobe
blueinno_rp2040.menu.uploadmethod.picoprobe.upload.tool.default=picoprobe
blueinno_rp2040.menu.uploadmethod.picoprobe_cmsis_dap=Picoprobe (CMSIS-DAP)
blueinno_rp2040.menu.uploadmethod.picoprobe_cmsis_dap.build.ram_length=256k
blueinno_rp2040.menu.uploadmethod.picoprobe_cmsis_dap.build.debugscript=picoprobe_cmsis_dap.tcl
blueinno_rp2040.menu.uploadmethod.picoprobe_cmsis_dap.upload.maximum_data_size=262144
blueinno_rp2040.menu.uploadmethod.picoprobe_cmsis_dap.upload.tool=picoprobe_cmsis_dap
blueinno_rp2040.menu.uploadmethod.picoprobe_cmsis_dap.upload.tool.default=picoprobe_cmsis_dap
blueinno_rp2040.menu.uploadmethod.picodebug=Pico-Debug
blueinno_rp2040.menu.uploadmethod.picodebug.build.ram_length=240k
blueinno_rp2040.menu.uploadmethod.picodebug.build.debugscript=picodebug.tcl
blueinno_rp2040.menu.uploadmethod.picodebug.build.picodebugflags=-UUSE_TINYUSB -DNO_USB -DDISABLE_USB_SERIAL -I{runtime.platform.path}/tools/libpico
blueinno_rp2040.menu.uploadmethod.picodebug.upload.maximum_data_size=245760
blueinno_rp2040.menu.uploadmethod.picodebug.upload.tool=picodebug
blueinno_rp2040.menu.uploadmethod.picodebug.upload.tool.default=picodebug
